app/controllers/login_controller.rb

  def finalize
    if response = request.env['omniauth.auth']

      if Token.exists?(1)
        token = Token.find(1)
        token.code = response['credentials']['token']
        token.save
      else
        token = Token.create(:code => response['credentials']['token'])
---
SELECT `tokens`.* FROM `tokens` WHERE `tokens`.`id` = 1 LIMIT 1
INSERT INTO `tokens` (`code`, `created_at`, `updated_at`) VALUES ('00e0c2afb7a8491ff95c366b4584149b', '2012-06-15 19:56:46', '2012-06-15 19:56:46')