app/controllers/webhook_controller.rb

  def test
    @badDates = Array.new

    @first_of_month = '2012-06-01'
    @end_of_month = '2012-06-30'
    @day_buffer = 3
    @quantity = 2

    startTime = Date.new
    startTime = Date.parse(@first_of_month)
    startTime -= @day_buffer

    endTime = Date.new
    endTime = Date.parse(@end_of_month)
    endTime += (@day_buffer + 60)

    @rentals = Rental.where('pickupDate >= ? AND deliveryDate <= ?', startTime, endTime)
---
SELECT `rentals`.* FROM `rentals` WHERE (`rentals`.`pickupDate` BETWEEN '2012-05-29' AND '2012-06-04') AND (`rentals`.`deliveryDate` BETWEEN '2012-05-29' AND '2012-06-04')

  def order_created
    data = ActiveSupport::JSON.decode(request.body.read)
    # puts data.inspect
    # render :json => data

    @order = ShopifyAPI::Order.find(data['id'])
    @note_attributes = @order.note_attributes

    @id_customer = update_customer({:email => @order.attributes[:customer].attributes['email'], :first_name => @order.attributes[:customer].attributes['first_name'], :last_name => @order.attributes[:customer].attributes['last_name'], :customerID => @order.attributes[:customer].attributes['id'], :note => @order.attributes[:customer].attributes['note'], :phone => data['billing_address']['phone']})
    @id_location = update_locations(@order.attributes[:customer].attributes['id'], data['shipping_address'])

    products = data["line_items"]

    if products
      products.each do |product|
          @id_product = update_product(product['product_id'])
          date_query = @attributes.select {|f| f.name == 'date_delivery-#{product["id"]}' }

          Rental.create(:product_id => @id_product, :location_id => @id_location, :customer_id => @id_customer, :orderID => data['id'])
---
INSERT INTO `customers` (`created_at`, `customerID`, `email`, `first_name`, `last_name`, `note`, `phone`, `status`, `updated_at`) VALUES ('2012-06-18 16:03:22', 93096168, 'gigabytestudio@gmail.com', 'Joe', 'Blow', NULL, '6133663007', 1, '2012-06-18 16:03:22')
INSERT INTO `locations` (`address1`, `address2`, `city`, `company`, `country`, `country_code`, `created_at`, `customer_id`, `first_name`, `last_name`, `latitude`, `longitude`, `name`, `phone`, `province`, `province_code`, `status`, `updated_at`, `zip`) VALUES ('123 fake', '', 'Ottawa', '', 'Canada', 'CA', '2012-06-18 18:18:12', 7, 'Joe', 'Blow', 45.345677, -75.674165, 'Joe Blow', '6133663007', 'Ontario', 'ON', 1, '2012-06-18 18:18:12', 'k1v 9n6')
INSERT INTO `products` (`body_html`, `created_at`, `productID`, `productImage`, `productPrice`, `productSku`, `quantity`, `status`, `tags`, `title`, `updated_at`) VALUES ('Product description 1<br />\n', '2012-06-18 19:35:46', 93626118, 'http://cdn.shopify.com/s/files/1/0156/0293/products/Penguins.jpg?104', 0, '', NULL, 1, '', 'Product 1', '2012-06-18 19:35:46')
INSERT INTO `rentals` (`chargifyID`, `created_at`, `customer_id`, `deliveryDate`, `location_id`, `orderID`, `pickupDate`, `product_id`, `type`, `updated_at`) VALUES (NULL, '2012-06-18 19:44:30', 10, NULL, 6, 133291662, NULL, 5, 'single', '2012-06-18 19:44:30')